{"keras_version": "1.1.0", "config": [{"config": {"mask_zero": false, "activity_regularizer": null, "output_dim": 100, "dropout": 0.0, "input_length": 55, "batch_input_shape": [null, 55], "input_dtype": "int32", "input_dim": 1193515, "W_regularizer": null, "init": "uniform", "W_constraint": null, "trainable": true, "name": "embedding_4"}, "class_name": "Embedding"}, {"config": {"layer": {"config": {"output_dim": 100, "input_length": null, "return_sequences": false, "stateful": false, "go_backwards": false, "b_regularizer": null, "U_regularizer": null, "dropout_W": 0.0, "input_dim": 100, "W_regularizer": null, "init": "glorot_uniform", "dropout_U": 0.0, "inner_init": "orthogonal", "forget_bias_init": "one", "unroll": false, "inner_activation": "hard_sigmoid", "activation": "tanh", "trainable": true, "consume_less": "cpu", "name": "forward_lstm_4"}, "class_name": "LSTM"}, "name": "bidirectional_4", "trainable": true, "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "output_dim": 50, "b_constraint": null, "trainable": true, "b_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "WeightRegularizer"}, "input_dim": null, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "name": "dense_10"}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "output_dim": 25, "b_constraint": null, "trainable": true, "b_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "WeightRegularizer"}, "input_dim": null, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "name": "dense_11"}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "output_dim": 1, "b_constraint": null, "trainable": true, "b_regularizer": null, "input_dim": null, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "W_constraint": null, "activation": "softsign", "name": "dense_12"}, "class_name": "Dense"}], "class_name": "Sequential"}